app/Controllers/HomeControl.php

    public function produk(): string
    {
        $ProdukModel = new ProdukModel();
        $dataProduk = $ProdukModel->findAll();
---
SELECT *
FROM `produk`

    public function tambah(): string
    {
        $ProdukModel = new ProdukModel();
        $dataProduk = $ProdukModel->findAll();
---
SELECT *
FROM `produk`